libs/typograf/artlebedev.soap.xml

<?xml version="1.0" encoding="{charset}"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<ProcessText xmlns="http://typograf.artlebedev.ru/webservices/">
			<text><![CDATA[{text}]]></text>
			<entityType>{entity-type}</entityType>
			<useBr>{newline-insert}</useBr>
			<useP>{paragraph-insert}</useP>
			<maxNobr>{max-nobr}</maxNobr>
		</ProcessText>
	</soap:Body>
</soap:Envelope>
